Revit 2027 API
RebarShapeConstraintFixedSegmentDir Class
 A constraint that can be applied to a RebarShapeSegment and fixes the direction of the segment in UV-space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintFixedSegmentDir : RebarShapeConstraint
Public Class RebarShapeConstraintFixedSegmentDir
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintFixedSegmentDir : public RebarShapeConstraint
type RebarShapeConstraintFixedSegmentDir =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintFixedSegmentDir type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintFixedSegmentDir |  Create a fixed segment direction constraint.
Top
Properties
Name | Description
Direction |  The direction of the RebarShapeSegment in UV-space.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RebarShapeConstraint)
Top
Methods
Name | Description
Dispose
(Inherited from RebarShapeConstraint)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParamId |  Return the Id of the parameter associated with this constraint.
(Inherited from RebarShapeConstraint)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace